<a href="https://colab.research.google.com/github/Romasha-Guin/Edulyt-India/blob/main/Problem_Statement_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Problem Statement 1:**

In [140]:
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
%matplotlib inline

Load the dataset.

In [141]:
df_1 = pd.read_csv('Customer.csv')
df_2 = pd.read_csv('Repayment.csv')
df_3 = pd.read_csv('Spend.csv')

**Sanity Checks â€“ Data Cleaning**

Replacing values where age is less than 18 with NaN.

In [142]:
df_1['Age'] = df_1['Age'].mask(df_1['Age'] < 18)
df_1.head()

,Sl No:,Customer,Age,City,Credit Card Product,Limit,Company,Segment
0,1,A1,NaN,BANGALORE,Gold,"INR 5,00,000.00",C1,Self Employed
1,2,A2,35.5346,CALCUTTA,Silver,"INR 1,00,000.00",C2,Salaried_MNC
2,3,A3,NaN,COCHIN,Platimum,"INR 10,000.00",C3,Salaried_Pvt
3,4,A4,45.8203,BOMBAY,Platimum,"INR 10,001.00",C4,Govt
4,5,A5,69.6639,BANGALORE,Platimum,"INR 10,002.00",C5,Normal Salary

In [143]:
df_2.rename(columns={'Amount': 'Amount_x'}, inplace=True)
df_3.rename(columns={'Amount': 'Amount_y'}, inplace=True)

In [144]:
df_2.head()

   SL No: Customer      Month       Amount_x
0       1       A1  12-Jan-04  331844.007400
1       2       A1  03-Jan-04  441139.807300
2       3       A1  15-Jan-04   32480.004010
3       4       A1  25-Jan-04   90636.966530
4       5       A1  17-Jan-05    1581.969829

In [145]:
df_3.head()

   Sl No: Customer      Month       Type  Amount_y
0       1       A1  12-Jan-04  JEWELLERY    473776
1       2       A1  03-Jan-04      PETRO    335579
2       3       A1  15-Jan-04    CLOTHES    371041
3       4       A1  25-Jan-04       FOOD    141178
4       5       A1  17-Jan-05     CAMERA    398404

To give a credit of 2% of the surplus amount in the next month billing for customers who have repayment greater than spends:

In [146]:
merged_df = pd.merge(df_2, df_3, on=['Customer', 'Month'])
merged_df['Surplus'] = merged_df['Amount_x'] - merged_df['Amount_y']

In [147]:
merged_df.head()

,SL No:,Customer,Month,Amount_x,Sl No:,Type,Amount_y,Surplus
0,1,A1,12-Jan-04,331844.0074,1,JEWELLERY,473776,-141931.9926
1,1,A1,12-Jan-04,331844.0074,103,TRAIN TICKET,52225,279619.0074
2,103,A1,12-Jan-04,390074.7900,1,JEWELLERY,473776,-83701.2100
3,103,A1,12-Jan-04,390074.7900,103,TRAIN TICKET,52225,337849.7900
4,2,A1,03-Jan-04,441139.8073,2,PETRO,335579,105560.8073

In [148]:
credit_df = merged_df[merged_df['Surplus'] > 0]
credit_df['Credit'] = 0.02 * credit_df['Surplus']
credit_df['Next Month Billing'] = credit_df['Amount_y'] - credit_df['Credit']

<ipython-input-148-e470bf8c4d0b>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  credit_df['Credit'] = 0.02 * credit_df['Surplus']
<ipython-input-148-e470bf8c4d0b>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  credit_df['Next Month Billing'] = credit_df['Amount_y'] - credit_df['Credit']

In [149]:
credit_df.head()

,SL No:,Customer,Month,Amount_x,Sl No:,Type,Amount_y,Surplus,Credit,Next Month Billing
1,1,A1,12-Jan-04,331844.0074,103,TRAIN TICKET,52225,279619.0074,5592.380148,46632.619852
3,103,A1,12-Jan-04,390074.7900,103,TRAIN TICKET,52225,337849.7900,6756.995800,45468.004200
4,2,A1,03-Jan-04,441139.8073,2,PETRO,335579,105560.8073,2111.216146,333467.783854
11,6,A1,23-Feb-05,357678.5077,229,CLOTHES,275671,82007.5077,1640.150154,274030.849846
13,201,A1,23-Feb-05,315077.2866,229,CLOTHES,275671,39406.2866,788.125732,274882.874268

**Tasks:**

In [150]:
#To calculate the monthly spend of each customer.
monthly_spend = df_3.groupby(['Customer', 'Month'])['Amount_y'].sum()
print(monthly_spend)

Customer  Month
A1        01-Feb-05    219342
          02-Apr-06    297988
          03-Aug-05    129388
          03-Feb-05    480096
          03-Jan-04    335579
                        ...
A95       15-Jan-04    347834
A96       25-Jan-04    320364
A97       12-Jan-04    164330
A98       03-Jan-04     87484
A99       15-Jan-04    476020
Name: Amount_y, Length: 1257, dtype: int64

In [151]:
#To calculate the monthly repayment of each customer.
monthly_repayment = df_2.groupby(['Customer', 'Month'])['Amount_x'].sum()
print(monthly_repayment)

Customer  Month
A1        01-Apr-06    169892.26350
          01-Feb-05    280990.70990
          03-Jan-04    441139.80730
          03-Jul-05    300581.70310
          03-Sep-06    108320.12050
                           ...
A95       15-Jan-04     75109.49223
A96       25-Jan-04    110139.01410
A97       12-Jan-04    174606.39230
A98       03-Jan-04     97802.59900
A99       15-Jan-04    358589.92430
Name: Amount_x, Length: 1281, dtype: float64

In [152]:
#To calculate the 10 highest paying customers.
sorted_df = df_2.sort_values(by='Amount_x', ascending=False)
top_customers = sorted_df.head(10)

print("Top 10 highest paying customers:")
print(top_customers)

Top 10 highest paying customers:
      SL No: Customer      Month     Amount_x
714      715      A37  25-Mar-06  499344.9402
1448    1449      A61  01-Apr-06  499136.7720
435      436      A26  03-Feb-05  498972.6750
80        81      A79  31-Mar-06  497836.7173
728      729      A22  08-May-06  497163.5294
107      108       A6  03-Jan-04  497144.9776
581      582      A20  12-Jan-04  496732.7302
1132    1133      A62  01-Feb-05  496662.7675
722      723      A45  19-Apr-06  496519.6605
511      512      A26  23-Nov-04  496338.3096

In [153]:
#To determine which segment of customers is spending more money.
merged_2 = pd.merge(df_1, df_3, on='Customer')

segment_spend = merged_2.groupby('Segment')['Amount_y'].sum()
sorted_segments = segment_spend.sort_values(ascending=False)
print("Segments in decreasing order of spend:")
print(sorted_segments)

Segments in decreasing order of spend:
Segment
Normal Salary    107707139
Salaried_Pvt      71704312
Self Employed     70975481
Govt              67325627
Salaried_MNC      63639486
Name: Amount_y, dtype: int64

In [154]:
#To determine which age group is spending more money.
age_spend = merged_2.groupby('Age')['Amount_y'].sum()
sorted_age = age_spend.sort_values(ascending=False)
print("Age groups in decreasing order of spend:")
print(sorted_age)

Age groups in decreasing order of spend:
Age
36.9228    9637821
52.3088    9595037
74.0014    9317672
44.2279    9148466
78.1426    9056652
            ...
40.5390      87484
62.9017      83931
68.4110      65278
57.0711      56942
23.6076      42254
Name: Amount_y, Length: 78, dtype: int64

In [155]:
#To determine the most profitable segment.
merged_3 = pd.merge(df_1, df_2, on='Customer')
segment_repayment = merged_3.groupby('Segment')['Amount_x'].sum()
segment_profit = segment_spend - segment_repayment

most_profitable_segment = segment_profit.idxmax()
print("Most profitable segment:", most_profitable_segment)

Most profitable segment: Salaried_Pvt

In [156]:
#To determine in which category the customers are spending more money.
category_spend = df_3.groupby('Type')['Amount_y'].sum()
highest_spend_category = category_spend.idxmax()
print("Category with the highest spend:", highest_spend_category)

Category with the highest spend: PETRO

In [157]:
#To calculate the monthly profit for the bank.
monthly_profit = monthly_repayment - monthly_spend

print("Monthly profit for the bank:")
print(monthly_profit)

Monthly profit for the bank:
Customer  Month
A1        01-Apr-06             NaN
          01-Feb-05     61648.70990
          02-Apr-06             NaN
          03-Aug-05             NaN
          03-Feb-05             NaN
                           ...
A95       15-Jan-04   -272724.50777
A96       25-Jan-04   -210224.98590
A97       12-Jan-04     10276.39230
A98       03-Jan-04     10318.59900
A99       15-Jan-04   -117430.07570
Length: 2045, dtype: float64

In [158]:
#To impose an interest rate of 2.9% on the due amount for each customer.
df_2['Due Amount w/ Interest'] =  df_2['Amount_x'] + (df_2['Amount_x'] * 1.029)
print(df_2)

      SL No: Customer      Month       Amount_x  Due Amount w/ Interest
0          1       A1  12-Jan-04  331844.007400           673311.491015
1          2       A1  03-Jan-04  441139.807300           895072.669012
2          3       A1  15-Jan-04   32480.004010            65901.928136
3          4       A1  25-Jan-04   90636.966530           183902.405089
4          5       A1  17-Jan-05    1581.969829             3209.816783
...      ...      ...        ...            ...                     ...
1495    1496      A67  09-May-05  200288.874100           406386.125549
1496    1497      A68  10-May-06  231194.702300           469094.050967
1497    1498      A69  11-Jul-06  391195.615800           793735.904458
1498    1499      A70  12-Aug-05  357629.618200           725630.495328
1499    1500      A71  13-Sep-04  179771.745200           364756.871011

[1500 rows x 5 columns]